Revit 2027 API
BuiltInFailures.ElectricalFailures.FeedThroughLugsIsOccupiedAndDisconnectOtherCircuits Property
 The feed through lugs is occupied, so other circuits connected with feed through lugs will be disconnected from this panel [Panel Name].
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId FeedThroughLugsIsOccupiedAndDisconnectOtherCircuits { get; }
Public Shared ReadOnly Property FeedThroughLugsIsOccupiedAndDisconnectOtherCircuits As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ FeedThroughLugsIsOccupiedAndDisconnectOtherCircuits {
	FailureDefinitionId^ get ();
}
static member FeedThroughLugsIsOccupiedAndDisconnectOtherCircuits : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.ElectricalFailures Class
Autodesk.Revit.DB Namespace